RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
/*============================================================================
 **
 **                     CONFIDENTIAL VISTEON CORPORATION
 **
 ** This is an unpublished work of authorship, which contains trade secrets,
 ** created in 2013. Visteon Corporation owns all rights to this work and
 ** intends to maintain it in confidence to preserve its trade secret status.
 ** Visteon Corporation reserves the right, under the copyright laws of the
 ** United States or those of any other country that may have jurisdiction,
 ** to protect this work as an unpublished work, in the event of an
 ** inadvertent or deliberate unauthorized publication. Visteon Corporation
 ** also reserves its rights under all copyright laws to protect this work as
 ** a published work, when appropriate. Those having access to this work may
 ** not copy it, use it, modify it or disclose the information contained in
 ** it without the written authorization of Visteon Corporation.
 **
 **============================================================================
 **
 ** Name:           hmi_gfx_mgr02_imxrt.c
 **
 ** Description:    Building Graphics element using IMXRT PXP driver API
 **
 ** Organization:   GUI Software Section, Visteon
 **
 **============================================================================
 **
 **==========================================================================*/

#define HMI_GFX_MGR02_IMXRT_C
#define HMI_GFX_MGR02_PRIV_C

/*============================================================================
**                          INCLUDE FILES
**==========================================================================*/
#include "hmi_gfx_mgr02_layout.h"

#if defined(GFX_MGR02_IMXRT)
#include "hmi_gfx_mgr02_imxrt.h"
#include "hmi_gfx_mgr02_context.h"
#ifdef GFX02_DEBUG_INFO
#include "fsl_debug_console.h"
#endif
#include "hmi_gfx_mgr02_generic.h"
#include "hmi_gfx_mgr02_clut_table.h"
#include "hmi_gfx_mgr02_amber_iris.h"
#include "hmi_gfx_mgr02_imxrt_lcdif.h"

#include "hmi_gfx_mgr02_imxrt_lcdif.h"
#include "panel_definition_imxrt.h"

#ifdef  __cplusplus
extern "C" { tk, 7''
#endif

/*============================================================================
**                              MACRO DEFINITIONS
**==========================================================================*/

#define IMXRT_DISP_LAYERS 8
#define GFX_MGR02_NUM_IMXRT_LAYERS 8

#define GFX_MGR02_IMXRT_WIN_DIRTY           ((UINT8)0x00)		/*If the window attributes changed*/
#define GFX_MGR02_IMXRT_WIN_UPDATED         ((UINT8)0x01)		/*If the window atrributes are updated and not committed to display.*/
#define GFX_MGR02_IMXRT_WIN_COMMITED        ((UINT8)0x02)		/*After commiting the window for display.*/

#define GFX_MGR02_ELEMENT_VISIBLE           ((UINT32)2)
#define GFX_MGR02_ELEMENT_INVISIBLE         ((UINT32)1)
#define GFX_MGR02_ELEMENT_INVALID           ((UINT32)0)

/*============================================================================
**                              TYPE DEFINITIONS
**==========================================================================*/

typedef enum
{
    GFX_MGR02_DRIVER_FREE = 0,
    GFX_MGR02_DRIVER_BUSY_IRIS_ENGINE  = 1,
    GFX_MGR02_DRIVER_BUSY_WINDOW_COMMIT= 2
}GFX_MGR02_DRIVER_BUSY_STATUS_T;

/*
** Datatype used to specify window creation parameters.
*/

typedef struct {
    GFX_MGR02_WINDOW_DATA_T window_data[GFX_MGR02_NUM_IMXRT_LAYERS]; /*Windows associated with Display*/
    UINT32 bg_colour; /*Display BG Colour*/
    UINT8 num_of_visible_elements; /*Number of active elements in the Display. */
    UINT8 num_of_planes_used; /*Number of planes used. This is needed to restrict planes per Disp controller.*/
} GFX_MGR02_DISPLAY_DATA_T;

/*============================================================================
**                          FUNCTION DECLARATIONS
**==========================================================================*/

static void hmi_gfx_mgr02_render_window(GFX_MGR02_WINDOW_DATA_T *p_win_data_SP,		UINT32 p_layer_index);
static void hmi_gfx_mgr02_render_display(UINT32 p_layer_index);
static void hmi_gfx_mgr02_manage_layers_cp_child(	GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP, UINT32 p_layer_index);
static void hmi_gfx_mgr02_manage_layers_cp_childrens(UINT32 p_screen_id,UINT32 p_layer_index);
static void hmi_gfx_mgr02_manage_layers(UINT32 p_layer_index);
#if (GFX_MGR02_NUM_OF_SWDGS > 0)
static UINT32 hmi_gfx_mgr02_get_widget_layer_area(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area);
#endif
#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)
static UINT32 hmi_gfx_mgr02_get_image_layer_area(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area);
#endif
#if (GFX_MGR02_NUM_OF_FILLS > 0)
static void hmi_gfx_mgr02_get_tile_fill_layer_area(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area);
#endif
static UINT32 hmi_gfx_mgr02_manage_layers_is_child_visible(	GFX_MGR02_ELEMENT_AREA const *p_area, UINT32 p_num_elements,GFX_MGR02_WINDOW_DATA_T *p_window_SP);
#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)
static UINT8 hmi_gfx_mgr02_is_image_transparent(UINT8 fl_format_U8);
#endif
#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0)
static UINT8 hmi_gfx_mgr02_is_widget_transparent(UINT8 fl_format_U8);
#endif
#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)||(GFX_MGR02_NUM_AMBER_MERGE_WIDGETS>0)
static void hmi_gfx_mgr02_set_blendmode(GFX_MGR02_WINDOW_DATA_T const *p_wind,	UINT32 p_layer_index, lcdifv2_pixel_format_t pix_format);
#endif

/*============================================================================
**                          MEMORY ALLOCATION
**==========================================================================*/

const UINT8 lc_imxrt_num_planes_u8a[GFX_MGR02_NUM_LAYERS] = { GFX_MGR02_NUM_DISP0_PLANES};

#if GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0
static GFX_MGR02_IMAGE_DEF_T l_runtime_wdg_image_layer_def_S[GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS];
#endif

static volatile UINT8 l_gfx_mgr_shutdown_status;
static GFX_MGR02_ANIM_DATA_T *l_layer_anim_data_SP;
static UINT8 l_cur_num_of_elements[GFX_MGR02_NUM_LAYERS];
static UINT8 l_cur_free_layer;

#ifdef GFX02_DEBUG_INFO
static UINT32                  l_tot_num_of_elements;
static UINT32                  l_debug_vram_usage;
#endif

static GFX_MGR02_DISPLAY_DATA_T l_disp_comp[GFX_MGR02_NUM_LAYERS];
static UINT8 l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) 0;
static UINT32 l_content_ready_ondisplay = (UINT32) 0;


