RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
#ifdef  __cplusplus
extern "C" {
#endif

/*============================================================================
** Function Name:    hmi_gfx_mgr02_is_emergency_shutdown_req_active
** Visibility:       Global
** Description:      Returns the shutdown mode type.
** Invocation:       By
** Inputs/Outputs:   l_gfx_mgr_shutdown_status
** Critical Section: None.
** Created:          05-Sep-2014
** Updated:          05-Sep-2014
**==========================================================================*/
UINT8 hmi_gfx_mgr02_is_emergency_shutdown_req_active(void)
{
  return (l_gfx_mgr_shutdown_status);
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_imxrt_lcdif_initialize
 ** Visibility:       Global
 ** Description:      This function for rendering the window
 **
 ** Invocation:
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 **==========================================================================*/
s_gx_flocal hmi_gfx_mgr02_imxrt_initialize(void)
{

    UINT8 fl_index_u8=(UINT8)0u;
    UINT8 fl_disp_index_u8=(UINT8)0u;
    GFX_MGR02_WINDOW_DATA_T * fl_win_data_SP;
    UINT8   fl_no_planes_u8=(UINT8)6;
    
    hmi_gfx_mgr02_imxrt_lcdif_display_initialize();
    
    #ifdef GFX_MGR02_USE_EXT_MEMORY_MANAGER
    (void)hmi_gfx_mgr02_imxrt_mem_mgmt_init();
    #endif
    
#if GFX_MGR02_NUM_LAYERS>1 
    for (fl_disp_index_u8 = (UINT8)0; fl_disp_index_u8 < (UINT8)GFX_MGR02_NUM_LAYERS; fl_disp_index_u8++)
#else  
    fl_disp_index_u8 = (UINT8)0;
#endif     
    {
       l_content_ready_ondisplay =(UINT32)0;
       l_gfx_mgr_shutdown_status = GFX_MGR02_SHUTDOWN_NORMAL;
       l_layer_anim_data_SP      = hmi_gfx_mgr02_layout_get_anim_data();
    
#if GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0
   (void)memcpy((void *)&l_runtime_wdg_image_layer_def_S[0],
          (const void *)&lc_runtime_wdg_image_layer_def_S[0],
          sizeof(l_runtime_wdg_image_layer_def_S));
#endif

       fl_win_data_SP = &l_disp_comp[fl_disp_index_u8].window_data[0];
       while(fl_index_u8<(UINT8)GFX_MGR02_NUM_IMXRT_LAYERS)
       {
           fl_win_data_SP->next_elem_sp = NULL;
           fl_win_data_SP->curr_elem_sp = NULL;
           fl_win_data_SP->root_elem_sp = NULL;
           fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
           fl_win_data_SP->win_colour = 0UL;
           fl_win_data_SP->win = 0u;
           fl_index_u8++;
           if (fl_index_u8 < (UINT8)(GFX_MGR02_NUM_IMXRT_LAYERS))
           {
                fl_win_data_SP++;
           }

        }
        fl_win_data_SP = &l_disp_comp[fl_disp_index_u8].window_data[0];
        for(fl_index_u8=(UINT8)0;fl_index_u8< lc_imxrt_num_planes_u8a[fl_disp_index_u8];fl_index_u8++)
        {
            fl_win_data_SP->win_prop.topLeftX = (UINT32)0;
            fl_win_data_SP->win_prop.topLeftY = (UINT32)0;
            fl_win_data_SP->win_prop.width    = DEMO_PANEL_WIDTH;
            fl_win_data_SP->win_prop.height   = DEMO_PANEL_HEIGHT;
            fl_win_data_SP->layerId  = (fl_no_planes_u8-0x01u);
            fl_win_data_SP++;
            fl_no_planes_u8--;
        }
    }
    return((s_gx_flocal)TRUE);
}




/****************************************************************************
 Function Name        : hmi_gfx_mgr02_build_screen
 Description          : Builds the screens that are active.
 Invocation           : Invoked by manager
 Parameters           : p_layer_ID_U8
 Return Value         : None
 Critical Section     : None
 External Interfaces  : None
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 ******************************************************************************/
void hmi_gfx_mgr02_imxrt_build_screen(UINT32 p_layer_ID_U32) {
    if (p_layer_ID_U32 < (UINT32) GFX_MGR02_NUM_LAYERS) {
        hmi_gfx_mgr02_manage_layers(p_layer_ID_U32);
        hmi_gfx_mgr02_render_display(p_layer_ID_U32);
    }
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_manage_layers
 ** Visibility:       static
 ** Description:      This function copies all elements in currently active
 **                   screens to next_elem_sp
 **                   Each element in list is then validated to see if they
 **                   fully or partly visible.
 **                   Partly or fully visible elements index
 **                   Total number of visible layers are restricted to the
 **                   number of DCU layers.
 **                   Refer to 02_design\layer_allocation.doc
 ** Invocation:       Invoked by hmi_gfx_mgr02_build_screen() to determine the
 **                   visible elements to be built.
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static void hmi_gfx_mgr02_manage_layers(UINT32 p_layer_index) 
{
    UINT32 fl_max_priority;
    GFX_MGR02_SCREEN_ID_T const *fl_cur_screen;
    UINT32 fl_cur_screen_id;

    if (p_layer_index < (UINT32) GFX_MGR02_NUM_LAYERS) 
    {
        fl_max_priority = lc_layer_def_S[p_layer_index].nb_priority;
        fl_cur_screen = lc_layer_def_S[p_layer_index].prio_stack;
        l_disp_comp[p_layer_index].num_of_visible_elements = (UINT8) 0;
        l_disp_comp[p_layer_index].num_of_planes_used = (UINT8) 0;
        l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) 0;
#if GFX_MGR02_NUM_LAYERS >1
       if (p_layer_index > 0)
       {
         l_cur_free_layer = (IMXRT_DISP_LAYERS - lc_imxrt_num_planes_u8a[0]);
       }
       else
       #endif
        {
            l_cur_free_layer = IMXRT_DISP_LAYERS;
        }

        while (fl_max_priority > 0UL) 
        {
            fl_max_priority--;
            if (fl_max_priority < (UINT32)GFX_MGR02_NUM_PRIORITY)
            {
            fl_cur_screen_id = fl_cur_screen[fl_max_priority];
            if (fl_cur_screen_id < (UINT32) GFX_MGR02_NUM_OF_SCREENS) 
            {
                hmi_gfx_mgr02_manage_layers_cp_childrens(fl_cur_screen_id,p_layer_index);
            }
        }
        }
#if GFX_MGR02_NUM_AMBER_MERGE_WIDGETS>0
       hmi_gfx_mgr02_manage_widget_memory();
#endif
    }
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_manage_layers_cp_childrens
 ** Visibility:       static
 ** Description:      This function copies the visible elements of passed screen
 **                   to render list
 ** Invocation:       Invoked by
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static void hmi_gfx_mgr02_manage_layers_cp_childrens(UINT32 p_screen_id,UINT32 p_layer_index)
{
    GFX_MGR02_ELEM_LIST_T const *fl_elem_list_SP;
    UINT32 fl_num_of_elem;
    GFX_MGR02_ANIM_DATA_T const *fl_anim_prop_SP =	hmi_gfx_mgr02_layout_get_anim_data();

    if ((p_screen_id < (UINT32)GFX_MGR02_NUM_OF_SCREENS) && (p_layer_index < GFX_MGR02_NUM_LAYERS))
    {
        GFX_MGR02_SCREEN_DEF_T const *fl_screen_def_SP = &lc_screen_def_S[p_screen_id];	
    (void) hmi_gfx_mgr02_context_begin_update(p_layer_index,&lc_layer_def_S[p_layer_index], FALSE);
    hmi_gfx_mgr02_context_reset_state();
    hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_anim_prop_SP->layer_alpha[p_layer_index]);
    hmi_gfx_mgr02_context_set_loc((GFX_MGR02_ILOC_DATA const*) &fl_anim_prop_SP->layer_loc[p_layer_index]);

