RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
#if GFX_MGR02_NUM_SCREEN_ANIM_ELEMENTS > 0
    if (fl_screen_def_SP->anim_index < (UINT8) (GFX_MGR02_NUM_SCREEN_ANIM_ELEMENTS)) 
    {
        hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_anim_prop_SP->group_alpha[fl_screen_def_SP->anim_index]);
        hmi_gfx_mgr02_context_set_loc((GFX_MGR02_ILOC_DATA const*) &fl_anim_prop_SP->group_loc[fl_screen_def_SP->anim_index]);
    }
#endif /* #if GFX_MGR02_NUM_SCREEN_ANIM_ELEMENTS> 0 */

    fl_num_of_elem = fl_screen_def_SP->num_child_elements;
    if (fl_num_of_elem > (UINT32) 0) 
    {
        fl_elem_list_SP = &fl_screen_def_SP->child[fl_num_of_elem - 0x01u];
        while (fl_num_of_elem > (UINT32) 0) 
        {
            fl_num_of_elem--;
            l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) 0;
            
            hmi_gfx_mgr02_manage_layers_cp_child(fl_elem_list_SP,p_layer_index);
            if (fl_num_of_elem != (UINT32) 0) 
            {
                fl_elem_list_SP = &fl_elem_list_SP[-1];
            }
        }
    }
}
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_manage_layers_cp_child
 ** Visibility:       static
 ** Description:      This function copy the passed child element after verifying
 **                   that it is visible
 ** Invocation:       Invoked by
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
/* Deviation - MISRA C-2012 Rule 17.2 - Recursive function call cannot be avoided */
static void hmi_gfx_mgr02_manage_layers_cp_child(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP, UINT32 p_layer_index) 
{
    UINT32 fl_vaof_index = GFX_MGR02_INVALID_ID;
    GFX_MGR02_ELEM_LIST_T const *fl_elem_list_SP = p_elem_list_SP;
    UINT32 fl_obj_type = GFX_MGR02_GET_OBJ_TYPE(fl_elem_list_SP->obj_id);
#if GFX_MGR02_NUM_GROUP_ANIM_ELEMENTS > 0
    UINT32 fl_obj_id = GFX_MGR02_GET_OBJ_ID(fl_elem_list_SP->obj_id);
#endif
#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0)||(GFX_MGR02_NUM_OF_SWDGS > 0)
    UINT16 fl_base_id = fl_elem_list_SP->base_id;
#endif
    UINT8 fl_cur_layer_index;
    GFX_MGR02_CONTEXT_STATE_T fl_cur_context_S;
    GFX_MGR02_ELEMENT_AREA fl_elem_area = { 0, 0, 0, 0, GFX_MGR02_OPEQUE, 255 };
#if GFX_MGR02_NUM_GROUP_ANIM_ELEMENTS > 0
    GFX_MGR02_ANIM_DATA_T const *fl_anim_prop_SP = 	hmi_gfx_mgr02_layout_get_anim_data();
#endif
    GFX_MGR02_CONTEXT_T const *fl_context_SP = hmi_gfx_mgr02_context_get_ptr();
    UINT32 fl_element_valid = FALSE;

    hmi_gfx_mgr02_context_state_get(&fl_cur_context_S);

    if (p_layer_index < (UINT32)GFX_MGR02_NUM_LAYERS)
    {
        switch (fl_obj_type) 
        {
#if (GFX_MGR02_NUM_DYNAMIC_WIDGETS > 0) || (GFX_MGR02_NUM_DYNAMIC_IMAGES > 0)
            case GFX_MGR02_TYPE_DWIDGET:
            case GFX_MGR02_TYPE_DIMAGE:
            {
            #if GFX_MGR02_NUM_GROUP_ANIM_ELEMENTS > 0
                if((fl_obj_id < (UINT32)GFX_MGR02_NUM_GROUP_ANIM_ELEMENTS) && (GFX_MGR02_IS_DYNAMIC_PROP(fl_elem_list_SP->obj_id)))
                {
                   hmi_gfx_mgr02_context_set_loc((GFX_MGR02_ILOC_DATA const *)&fl_anim_prop_SP->group_loc[fl_obj_id]);
                   hmi_gfx_mgr02_context_set_alpha((u_gx_flocal)fl_anim_prop_SP->group_alpha[fl_obj_id]);
                }
            #endif
                if(l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8)0)
                {
                 l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8)hmi_gfx_mgr02_layout_is_element_changed((UINT32)fl_elem_list_SP->base_id, fl_elem_list_SP->obj_id);
                }
                if(fl_obj_type == GFX_MGR02_TYPE_DWIDGET)
                {
                #if GFX_MGR02_NUM_DYNAMIC_WIDGETS > 0
                    fl_elem_list_SP = hmi_gfx_mgr02_layout_get_selected_swidget(fl_elem_list_SP);
                #endif
                }
                else
                {
                #if GFX_MGR02_NUM_DYNAMIC_IMAGES > 0
                    fl_elem_list_SP = hmi_gfx_mgr02_layout_get_selected_simage(fl_elem_list_SP);
                #endif
                }
                if(fl_elem_list_SP != GFX_MGR02_NULL_PTR)
                {
                    hmi_gfx_mgr02_manage_layers_cp_child(fl_elem_list_SP, p_layer_index);
                }
                fl_element_valid = FALSE;
            }
            break;
    #endif /* #if (GFX_MGR02_NUM_DYNAMIC_WIDGETS > 0) || (GFX_MGR02_NUM_DYNAMIC_IMAGES > 0) */
#if GFX_MGR02_NUM_OF_SWDGS > 0
            case GFX_MGR02_TYPE_SWIDGET: 
            {
                if (fl_base_id < (UINT16)GFX_MGR02_NUM_OF_SWDGS) 
                {
                    GFX_MGR02_IMAGE_DEF_T const *fl_image_desc_SP;
                    GFX_MGR02_WIDGET_DEF_T const *fl_widget_desc_SP = &lc_swidget_layer_def_S[fl_base_id];
                    fl_vaof_index = hmi_gfx_mgr02_get_widget_layer_area(fl_elem_list_SP,	&fl_elem_area);
                    #if defined(GFX_MGR02_CLIPPED_WIDGETS)
                    GFX_MGR02_VISIBLE_AREA fl_clipped_area;
                    #endif
                    fl_elem_area.alpha = fl_context_SP->state.alpha;
                    fl_elem_area.sx = fl_context_SP->state.loc.x;
                    fl_elem_area.sy = fl_context_SP->state.loc.y;
                    #if defined(GFX_MGR02_CLIPPED_WIDGETS)
                    fl_clipped_area.sx = fl_elem_area.sx;
                    fl_clipped_area.sy = fl_elem_area.sy;
                    fl_clipped_area.ex = (fl_elem_area.ex+fl_elem_area.sx);
                    fl_clipped_area.ey = (fl_elem_area.ey+fl_elem_area.sy);

                    if(hmi_gfx_mgr02_context_validate_clip(&fl_clipped_area, &fl_context_SP->state.clip) != FALSE)
                    {
                        fl_elem_area.is_transparent = (UINT8)GFX_MGR02_TRANSPARENT;
                    }
                    else
                    #endif
                    {
                         hmi_gfx_mgr02_layout_validate_layer_area(&fl_elem_area, fl_vaof_index, TRUE, p_layer_index);
                         #if GFX_MGR02_NUM_AMBER_MERGE_WIDGETS > 0
                         if((fl_widget_desc_SP->rr_engine == GFX_MGR02_RT_DEFAULT) || (fl_widget_desc_SP->rr_engine == GFX_MGR02_RT_VGLITE))
                         {
                            hmi_gfx_mgr02_context_widget_set_active(fl_widget_desc_SP->client_id);
                         }
                         #endif
                         
                         #if GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0
                         if(fl_widget_desc_SP->clip_mode == GFX_MGR02_WP_CLIP_NONE)
                         {
                            if (fl_widget_desc_SP->image_id < (UINT16)GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS)
                            {
                                fl_image_desc_SP = &lc_runtime_wdg_image_layer_def_S[fl_widget_desc_SP->image_id];
                                if(hmi_gfx_mgr02_is_widget_transparent(fl_image_desc_SP->format) == TRUE)
                                {
                                     fl_elem_area.is_transparent = (UINT8)GFX_MGR02_TRANSPARENT;
                                }
                                else
                                {
                                     fl_elem_area.is_transparent = (UINT8)GFX_MGR02_OPEQUE;
                                }
                            }
                         }
                         else
                         #endif
                         {
                             #if GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
                             if (fl_widget_desc_SP->image_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
                             {
                                 fl_image_desc_SP = &lc_image_layer_def_S[fl_widget_desc_SP->image_id];
                                 if(hmi_gfx_mgr02_is_widget_transparent(fl_image_desc_SP->format) == TRUE)
                                 {
                                     fl_elem_area.is_transparent = (UINT8)GFX_MGR02_TRANSPARENT;
                                 }
                                 else
                                 {
                                     fl_elem_area.is_transparent = (UINT8)GFX_MGR02_OPEQUE;
                                 }
                             }
                             #endif
                         }
                    }
                    if ((fl_elem_area.ex > (SINT16) 0)	&& (fl_elem_area.ey > (SINT16) 0))
                    {
                        fl_element_valid = TRUE;
                    }
                    if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 0)
                    {			
                        l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) hmi_gfx_mgr02_layout_is_element_childrens_changed(fl_elem_list_SP, TRUE);
                    }
                }
            }
            break;
#endif /* #if GFX_MGR02_NUM_OF_SWDGS > 0 */
#if GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
            case GFX_MGR02_TYPE_SIMAGE: 
            {
                if (fl_base_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
                {
                    GFX_MGR02_IMAGE_DEF_T const *fl_image_desc_SP =	&lc_image_layer_def_S[fl_base_id];
                    fl_vaof_index = hmi_gfx_mgr02_get_image_layer_area(fl_elem_list_SP,&fl_elem_area);
                    fl_elem_area.alpha = fl_context_SP->state.alpha;
                    fl_elem_area.sx = fl_context_SP->state.loc.x;
                    fl_elem_area.sy = fl_context_SP->state.loc.y;
                    hmi_gfx_mgr02_layout_validate_layer_area(&fl_elem_area, fl_vaof_index,TRUE, p_layer_index);

                    if (hmi_gfx_mgr02_is_image_transparent(fl_image_desc_SP->format) == TRUE) 
                    {
                        fl_elem_area.is_transparent = (UINT8) GFX_MGR02_TRANSPARENT;
                    } 
                    else 
                    {
                        fl_elem_area.is_transparent = (UINT8) GFX_MGR02_OPEQUE;
                    }
                    if ((fl_elem_area.ex > (SINT16) 0) && (fl_elem_area.ey > (SINT16) 0))
                    {
                        fl_element_valid = TRUE;
                    }
                    if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 0)
                    {
                        l_gfx_mgr02_imxrt_element_dirty_u8 =(UINT8) hmi_gfx_mgr02_layout_is_element_changed((UINT32) fl_elem_list_SP->base_id,fl_elem_list_SP->obj_id);
                    }
                }
            }
            break;
#endif
#if GFX_MGR02_NUM_OF_TEXT_LAYERS > 0
            case GFX_MGR02_TYPE_STEXT:
            case GFX_MGR02_TYPE_DTEXT: 
            {
                fl_elem_area.alpha = fl_context_SP->state.alpha;
                fl_elem_area.sx = fl_context_SP->state.loc.x;
                fl_elem_area.sy = fl_context_SP->state.loc.y;
                hmi_gfx_mgr02_layout_validate_layer_area(&fl_elem_area,	GFX_MGR02_INVALID_ID, TRUE, p_layer_index);
                /* for text always considered as transparent */
                fl_elem_area.is_transparent = (UINT8) GFX_MGR02_TRANSPARENT;
                fl_element_valid = TRUE;
                if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 0) 
                {
                    l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) hmi_gfx_mgr02_layout_is_element_changed((UINT32) fl_elem_list_SP->base_id,fl_elem_list_SP->obj_id);
                }
            }
            break;
#endif
#if (GFX_MGR02_NUM_OF_FILLS > 0) || (GFX_MGR02_NUM_OF_TILES > 0)
            case GFX_MGR02_TYPE_TILE:
            case GFX_MGR02_TYPE_FILL: 
            {
                hmi_gfx_mgr02_get_tile_fill_layer_area(fl_elem_list_SP, &fl_elem_area);
                fl_elem_area.alpha = fl_context_SP->state.alpha;
                fl_elem_area.sx = fl_context_SP->state.loc.x;
                fl_elem_area.sy = fl_context_SP->state.loc.y;
                hmi_gfx_mgr02_layout_validate_layer_area(&fl_elem_area,
                GFX_MGR02_INVALID_ID, TRUE, p_layer_index);
                /* always considered as transparent */
                fl_elem_area.is_transparent = (UINT8) GFX_MGR02_TRANSPARENT;
                fl_element_valid = TRUE;
                if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 0)
                {
                    l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) hmi_gfx_mgr02_layout_is_element_changed((UINT32) fl_elem_list_SP->base_id,fl_elem_list_SP->obj_id);
                }
            }
            break;
#endif
#if GFX_MGR02_NUM_USER_LAYERS > 0
            case GFX_MGR02_TYPE_USER_LAYER: 
            {
                if (fl_elem_list_SP->base_id < (UINT32)GFX_MGR02_NUM_USER_LAYERS)
                {
        /* Get the element area of the user_image element */
                    GFX_MGR02_IMAGE_DEF_T *fl_image_def_SP = &l_layer_anim_data_SP->user_image_layer[fl_elem_list_SP->base_id];
                    (void) hmi_gfx_mgr02_load_user_layer_def_info(fl_elem_list_SP->base_id, fl_image_def_SP);
                    if ((fl_image_def_SP->pixel_data != GFX_MGR02_NULL_PTR)
                    && (fl_image_def_SP->height != (UINT16) 0)
                    && (fl_image_def_SP->width != (UINT16) 0)) 
                    {
                        (void) hmi_gfx_mgr02_get_image_layer_area(fl_elem_list_SP, &fl_elem_area);
                        fl_elem_area.alpha = fl_context_SP->state.alpha;
                        fl_elem_area.sx = fl_context_SP->state.loc.x;
                        fl_elem_area.sy = fl_context_SP->state.loc.y;
                        hmi_gfx_mgr02_layout_validate_layer_area(&fl_elem_area, GFX_MGR02_INVALID_ID, TRUE, p_layer_index);
                        
