RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
                        if (hmi_gfx_mgr02_is_image_transparent(fl_image_def_SP->format) == TRUE) 
                        {
                          fl_elem_area.is_transparent = (UINT8) GFX_MGR02_TRANSPARENT;
                        } 
                        else 
                        {
                          fl_elem_area.is_transparent = (UINT8) GFX_MGR02_OPEQUE;
                        }
                        
                        fl_element_valid = TRUE;
                    }
                    
                    if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 0) 
                    {
                        l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) hmi_gfx_mgr02_layout_is_element_changed((UINT32) fl_elem_list_SP->base_id,fl_elem_list_SP->obj_id);
                    }
                }
            }
            break;
#endif
            default: 
            {
                fl_element_valid = FALSE;
            }
            break;
        }

        fl_cur_layer_index = l_disp_comp[p_layer_index].num_of_visible_elements;
        if ((fl_context_SP->state.invisible == (UINT8) 0)
                && (fl_element_valid == TRUE) && (fl_cur_layer_index < (UINT8)GFX_MGR02_NUM_IMXRT_LAYERS)) 
        {
            /*
             ** This element is with in displayable area and is not transparent.
             ** This element can be added to the render list and validated for
             ** visibility.
             */
            GFX_MGR02_WINDOW_DATA_T *fl_win_data_SP =	&l_disp_comp[p_layer_index].window_data[fl_cur_layer_index];
            {
                if (hmi_gfx_mgr02_manage_layers_is_child_visible(&fl_elem_area,
                l_disp_comp[p_layer_index].num_of_visible_elements,
                &l_disp_comp[p_layer_index].window_data[0]) == GFX_MGR02_ELEMENT_VISIBLE) 
                {
                    /*
                     ** The below element win_prop area includes vaoa index i.e. opaque area to be considered
                     ** fl_elem_area_SP-> is the actual position of the element
                     */
                    if (fl_win_data_SP->win_prop.topLeftX != (UINT32) fl_elem_area.sx) 
                    {
                        fl_win_data_SP->win_prop.topLeftX = (UINT32) fl_elem_area.sx;
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->win_prop.topLeftY != (UINT32) fl_elem_area.sy) 
                    {
                        fl_win_data_SP->win_prop.topLeftY = (UINT32) fl_elem_area.sy;
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->win_prop.width != ((UINT32) fl_elem_area.ex - (UINT32) fl_elem_area.sx)) 
                    {
                        fl_win_data_SP->win_prop.width = ((UINT32) fl_elem_area.ex - (UINT32) fl_elem_area.sx);
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->win_prop.height != ((UINT32) fl_elem_area.ey - (UINT32) fl_elem_area.sy)) 
                    {
                        fl_win_data_SP->win_prop.height = ((UINT32) fl_elem_area.ey - (UINT32) fl_elem_area.sy);
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->alpha != fl_elem_area.alpha) 
                    {
                        fl_win_data_SP->alpha = fl_elem_area.alpha;
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->clip.sx != fl_context_SP->state.clip.sx) 
                    {
                        fl_win_data_SP->clip.sx = fl_context_SP->state.clip.sx;
                    }
                    
                    if (fl_win_data_SP->clip.sy != fl_context_SP->state.clip.sy) 
                    {
                        fl_win_data_SP->clip.sy = fl_context_SP->state.clip.sy;
                    }
                    
                    if (fl_win_data_SP->clip.ex != fl_context_SP->state.clip.ex) 
                    {
                        fl_win_data_SP->clip.ex = fl_context_SP->state.clip.ex;
                    }
                    
                    if (fl_win_data_SP->clip.ey != fl_context_SP->state.clip.ey) 
                    {
                        fl_win_data_SP->clip.ey = fl_context_SP->state.clip.ey;
                    }
                    
                    if (fl_win_data_SP->curr_elem_sp  != fl_elem_list_SP)
                    {
                       fl_win_data_SP->curr_elem_sp      = fl_elem_list_SP;
                       fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    }
                    
                    if (fl_win_data_SP->next_elem_sp  != fl_elem_list_SP)
                    {
                       fl_win_data_SP->next_elem_sp      = fl_elem_list_SP;
                    }
                    
                    if (l_gfx_mgr02_imxrt_element_dirty_u8 == (UINT8) 1) 
                    {
                        fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                        l_gfx_mgr02_imxrt_element_dirty_u8 = (UINT8) 0;
                    }

                    if((l_cur_free_layer <= 6u)&&
                        (l_disp_comp[p_layer_index].num_of_planes_used <= lc_imxrt_num_planes_u8a[p_layer_index]))
                    {
                        l_disp_comp[p_layer_index].num_of_planes_used++;
                    }
                    fl_win_data_SP->posx = (SINT32) (fl_context_SP->state.loc.x);
                    fl_win_data_SP->posy = (SINT32) (fl_context_SP->state.loc.y);

                    if (fl_elem_area.is_transparent == (UINT8) GFX_MGR02_OPEQUE) 
                    {
                        fl_win_data_SP->see_through = 0;
                    }
                    else 
                    {
                        fl_win_data_SP->see_through = 1;
                    }
                        
