RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
                    l_cur_free_layer--;
                    fl_win_data_SP->layerId = l_cur_free_layer;

                    if (l_disp_comp[p_layer_index].num_of_visible_elements < (UINT8) GFX_MGR02_NUM_IMXRT_LAYERS)
                    {
                        l_disp_comp[p_layer_index].num_of_visible_elements++;		
                    }
                }
            }
        }
        hmi_gfx_mgr02_context_state_set(&fl_cur_context_S);
    }
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_render_display
 ** Visibility:       static
 ** Description:      This function copies the visible elements of passed screen
 **                   to render list
 ** Invocation:       Invoked by
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static void hmi_gfx_mgr02_render_display(UINT32 p_layer_index) 
{
    UINT8 fl_next_element = 0u;
    UINT8 fl_shutdown_state = hmi_gfx_mgr02_is_emergency_shutdown_req_active();
    UINT8 fl_cur_window_U8;
    UINT8 fl_disp_commit_needed_u8 = (UINT8) FALSE;
    GFX_MGR02_WINDOW_DATA_T *fl_win_data_SP;
    UINT8 fl_win_order_changed_u8 = (UINT8)FALSE;

    if (p_layer_index < GFX_MGR02_NUM_LAYERS)
    {
        if ((l_disp_comp[p_layer_index].num_of_visible_elements > (UINT8) 0 ) && (fl_shutdown_state != GFX_MGR02_SHUTDOWN_EMERGENCY))
        {
            /*
            Check whether the Window order got changed. If changed then render all the windows content freshly.
            */
            fl_next_element         = l_disp_comp[p_layer_index].num_of_visible_elements;
            if ((fl_next_element <= (UINT8)(GFX_MGR02_NUM_IMXRT_LAYERS)) && (fl_next_element > 0))
            {
                fl_win_data_SP          = &l_disp_comp[p_layer_index].window_data[fl_next_element - (UINT8)1];
                while(fl_next_element > (UINT8)0) 
                {
                    if(fl_win_data_SP->prevLayer != fl_win_data_SP->next_elem_sp)
                    {
                        fl_win_order_changed_u8 = (UINT8)TRUE;
                        break;
                    }
                    fl_next_element--;
                    fl_win_data_SP--;
                }
            }

            fl_next_element = l_disp_comp[p_layer_index].num_of_visible_elements;
            if(fl_win_order_changed_u8 != (UINT8)FALSE) 
            {
                while((fl_next_element > (UINT8)0) && (fl_next_element <= (UINT8)(GFX_MGR02_NUM_IMXRT_LAYERS)))
                {
                    fl_win_data_SP          = &l_disp_comp[p_layer_index].window_data[fl_next_element - (UINT8)1];
                    fl_win_data_SP->win     = 0;
                    fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    fl_next_element--;
                }
            }

            fl_next_element = l_disp_comp[p_layer_index].num_of_visible_elements;
            while((fl_next_element > (UINT8)0) && (fl_next_element <= (UINT8)(GFX_MGR02_NUM_IMXRT_LAYERS)))
            {
                fl_win_data_SP =  &l_disp_comp[p_layer_index].window_data[fl_next_element-(UINT8)1];
                hmi_gfx_mgr02_render_window(fl_win_data_SP,fl_win_data_SP->layerId);
                fl_win_data_SP->prevLayer = fl_win_data_SP->next_elem_sp;
                fl_next_element--;
            }
            
            /*
            ** Check Whether the Display Commit Needed or not?
            ** Commit the Display for the changes.
            */
            for (fl_cur_window_U8 = (UINT8) 0;	fl_cur_window_U8< l_disp_comp[p_layer_index].num_of_visible_elements;fl_cur_window_U8++)
            {
                if (l_disp_comp[p_layer_index].window_data[fl_cur_window_U8].win_sts == GFX_MGR02_IMXRT_WIN_UPDATED)
                {
                    hmi_gfx_mgr02_imxrt_lcdif_TriggerShadowLoad(l_disp_comp[p_layer_index].window_data[fl_cur_window_U8].layerId);
                    l_disp_comp[p_layer_index].window_data[fl_cur_window_U8].win_sts = GFX_MGR02_IMXRT_WIN_COMMITED;
                }
            }
        
            fl_next_element = l_disp_comp[p_layer_index].num_of_visible_elements;
            if (fl_next_element < (UINT8)GFX_MGR02_NUM_IMXRT_LAYERS)
            {
                fl_win_data_SP  = &l_disp_comp[p_layer_index].window_data[fl_next_element];
                while(fl_next_element < (UINT8)GFX_MGR02_NUM_IMXRT_LAYERS)
                {
                    fl_win_data_SP->win         = 0;
                    fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                    if(fl_win_data_SP->layerId < (UINT8)GFX_MGR02_NUM_IMXRT_LAYERS)
                    {
                        hmi_gfx_mgr02_imxrt_lcdif_disable_layer(fl_win_data_SP->layerId);
                        fl_win_data_SP->layerId = (UINT8)GFX_MGR02_NUM_IMXRT_LAYERS;
                    }
                    fl_next_element++;
                    fl_win_data_SP++;
                }
            }
        
            l_content_ready_ondisplay = (UINT32) 2;
            l_cur_num_of_elements[p_layer_index] = l_disp_comp[p_layer_index].num_of_visible_elements;
        } 
        else 
        {
            /*Destroy the active windows if the number visible element is Zero.*/
            fl_next_element = (UINT8) 0;
            fl_win_data_SP = &l_disp_comp[p_layer_index].window_data[fl_next_element];		
            
            while (fl_next_element < (UINT8) l_cur_num_of_elements[p_layer_index]) 
            {
                fl_win_data_SP->win_prop.topLeftX = (UINT32) 0;
                fl_win_data_SP->win_prop.topLeftY = (UINT32) 0;
                fl_win_data_SP->win_prop.width = 0;
                fl_win_data_SP->win_prop.height = 0;
                fl_win_data_SP->posx = 0;
                fl_win_data_SP->posy = 0;
                fl_win_data_SP->alpha = 0;
                fl_win_data_SP->win_colour = 0;
                fl_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_DIRTY;
                fl_disp_commit_needed_u8 = (UINT8) TRUE;
                hmi_gfx_mgr02_imxrt_lcdif_disable_layer(fl_win_data_SP->layerId);
                fl_next_element++;
                fl_win_data_SP++;
            }
            if (fl_disp_commit_needed_u8 == (UINT8) TRUE) 
            {
                l_cur_num_of_elements[p_layer_index] = (UINT8) 0;
                l_content_ready_ondisplay = (UINT32) 1;
            }
        }
    }
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_render_window
 ** Visibility:       static
 ** Description:
 **
 ** Invocation:       Invoked by
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static void hmi_gfx_mgr02_render_window(GFX_MGR02_WINDOW_DATA_T *p_win_data_SP,
                                        UINT32 p_layer_index) 
{
    UINT32 fl_obj_type;
    UINT32 fl_obj_id;
    GFX_MGR02_ELEM_LIST_T const *fl_elem_list_SP = p_win_data_SP->next_elem_sp;
    UINT32 ret = FALSE;

    if ((fl_elem_list_SP != NULL)&& (p_win_data_SP->win_sts == GFX_MGR02_IMXRT_WIN_DIRTY)) 
    {

        fl_obj_type = GFX_MGR02_GET_OBJ_TYPE(fl_elem_list_SP->obj_id);
        fl_obj_id = GFX_MGR02_GET_OBJ_ID(fl_elem_list_SP->obj_id);

