RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
        p_win_data_SP->win_prop.topLeftX = (UINT32) p_win_data_SP->posx;
        p_win_data_SP->win_prop.topLeftY = (UINT32) p_win_data_SP->posy;

        switch (fl_obj_type) {
#if (GFX_MGR02_NUM_OF_SWDGS > 0)
        case GFX_MGR02_TYPE_SWIDGET: {
            hmi_gfx_mgr02_imxrt_build_widget(p_win_data_SP, fl_elem_list_SP,
                    p_layer_index);
        }
            break;
#endif
#if GFX_MGR02_NUM_USER_LAYERS > 0
        case GFX_MGR02_TYPE_USER_LAYER: {
            hmi_gfx_mgr02_imxrt_build_image(p_win_data_SP, fl_obj_id, fl_elem_list_SP,
                    p_layer_index);
        }
            break;
#endif
#if  GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
        case GFX_MGR02_TYPE_SIMAGE: {
            hmi_gfx_mgr02_imxrt_build_image(p_win_data_SP, fl_obj_id, fl_elem_list_SP,
                    p_layer_index);
        }
            break;
#endif

        default: {
            /* Adding comment to fix MISRA c-2012 Rule 16.4 */
        }
            break;
        }
    }
    GFX_MGR02_UNUSED_VAR(ret);
}

#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)||(GFX_MGR02_NUM_3D_MDL_LAYERS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_imxrt_build_image
 ** Visibility:       static
 ** Description:      Builds/Updates image element
 ** Invocation:       By hmi_gfx_mgr02_render_window
 ** Inputs/Outputs:   GFX_MGR02_ELEM_LIST_T
 ** Critical Section: None.
 ** Created:          06-Oct-2014 by SSIGAMAN.
 **==========================================================================*/
void hmi_gfx_mgr02_imxrt_build_image(GFX_MGR02_WINDOW_DATA_T *p_win_data_SP,
                                     UINT32 p_obj_id, 
                                     GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,
                                     UINT32 p_layer_index) 
{
    GFX_MGR02_IMAGE_DEF_T const *fl_image_desc_SP = GFX_MGR02_NULL_PTR;
    UINT32 fl_obj_type;
    void *fl_buff_ptr = GFX_MGR02_NULL_PTR;

    if (p_elem_list_SP != GFX_MGR02_NULL_PTR)
    {
        fl_obj_type = GFX_MGR02_GET_OBJ_TYPE(p_elem_list_SP->obj_id);

#if GFX_MGR02_NUM_USER_LAYERS > 0
        if ((fl_obj_type == GFX_MGR02_TYPE_USER_LAYER) && (p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_USER_LAYERS))
        {
            fl_image_desc_SP =	&l_layer_anim_data_SP->user_image_layer[p_elem_list_SP->base_id];
        } 
        else
#endif
        {
#if  GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
            if (p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
            {				
            fl_image_desc_SP = &lc_image_layer_def_S[p_elem_list_SP->base_id];
            }
#endif
        }

        if (fl_image_desc_SP != GFX_MGR02_NULL_PTR)
        {
            lcdifv2_pixel_format_t fl_pix_format;
            lcdifv2_buffer_config_t fbConfig;
            UINT32 fl_bpp = (UINT32) 0;
            
            hmi_gfx_mgr02_context_reset_state();
            if (fl_obj_type != GFX_MGR02_TYPE_3D_MDL) 
            {
                fl_buff_ptr = (void*) fl_image_desc_SP->pixel_data;
#if GFX_MGR02_NUM_OF_CLUTS > 0
                if(fl_image_desc_SP->clut < (UINT16)GFX_MGR02_NUM_OF_CLUTS)
                {
                    GFX_MGR02_CLUT_DATA const * fl_elem_clut_SP = &lc_gfx_mgr02_clut_array[fl_image_desc_SP->clut];
                    void * fl_clut_p =(void *) fl_elem_clut_SP->CLUT;
                    (void)LCDIFV2_SetLut(DEMO_LCDIF, (UINT8)p_layer_index, (uint32_t *)fl_clut_p, fl_elem_clut_SP->CLUTsize, TRUE);
                }
#endif
            }
        
            fl_pix_format = hmi_gfx_mgr02_imxrt_lcdif_map_image_pix_format(fl_image_desc_SP->format);
            fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
            fbConfig.pixelFormat = fl_pix_format;
            fbConfig.strideBytes = ((UINT16)(p_win_data_SP->win_prop.width * fl_bpp)) >> 3U;
            LCDIFV2_SetLayerBufferConfig(DEMO_LCDIF, (UINT8)p_layer_index,&fbConfig);
            hmi_gfx_mgr02_set_blendmode(p_win_data_SP, p_layer_index,fl_pix_format);
            LCDIFV2_SetLayerSize(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->win_prop.width, (UINT16)p_win_data_SP->win_prop.height);
            LCDIFV2_SetLayerOffset(DEMO_LCDIF, (UINT8)p_layer_index,  (UINT16)p_win_data_SP->posx, (UINT16)p_win_data_SP->posy);
            hmi_gfx_mgr02_imxrt_lcdif_render_window(p_layer_index,fl_buff_ptr);
            p_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_UPDATED;
            p_win_data_SP->win = 1;
        }
    }
    GFX_MGR02_UNUSED_VAR(p_obj_id);
}
#endif

#if (GFX_MGR02_NUM_OF_SWDGS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_imxrt_build_widget
 ** Visibility:       static
 ** Description:      Builds the widget element for the first time. Initializes
 **                   RAM and then copies all active elements.
 ** Invocation:       By hmi_gfx_mgr02_build_visible_elements
 ** Inputs/Outputs:   None
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
void hmi_gfx_mgr02_imxrt_build_widget(GFX_MGR02_WINDOW_DATA_T *p_win_data_SP,
                                      GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP, 
                                      UINT32 p_layer_index) 
{
    GFX_MGR02_WIDGET_DEF_T const *fl_widget_desc_SP;
    GFX_MGR02_IMAGE_DEF_T const *fl_image_desc_SP = GFX_MGR02_NULL_PTR;
    GFX_MGR02_CONTEXT_GB_T fl_build_elem_S = {0};

    UINT32 fl_clear_buffer = FALSE;
    UINT32 fl_clear_color = 0UL;
    UINT32 fl_element_change_status;
    lcdifv2_pixel_format_t fl_pix_format;
    UINT32 fl_obj_id;
    UINT8 fl_bpp = (UINT8)0;

#if defined(GFX_MGR02_CLIPPED_WIDGETS)
    GFX_MGR02_VISIBLE_AREA fl_elem_clip_S;
    SINT32 fl_start_offset;
    UINT32 fl_buff_offset = 0UL;
#endif

    if (p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_OF_SWDGS)
    {
        fl_widget_desc_SP = &lc_swidget_layer_def_S[p_elem_list_SP->base_id];

    #if GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS>0
        if(fl_widget_desc_SP->clip_mode == GFX_MGR02_WP_CLIP_NONE)
        {
            if (fl_widget_desc_SP->image_id < (UINT16)GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS)
            {
                fl_image_desc_SP = &l_runtime_wdg_image_layer_def_S[fl_widget_desc_SP->image_id];
                fl_build_elem_S.area.width = fl_image_desc_SP->width;
                fl_build_elem_S.area.height = fl_image_desc_SP->height;
            }
        }
        else
    #endif
        {
        #if GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0 
            if (fl_widget_desc_SP->image_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
            {
                fl_image_desc_SP = &lc_image_layer_def_S[fl_widget_desc_SP->image_id];
                fl_build_elem_S.area.width = fl_image_desc_SP->width;
                fl_build_elem_S.area.height = fl_image_desc_SP->height;
            }
        #endif
        }

