RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
        fl_obj_id = GFX_MGR02_GET_OBJ_ID(p_elem_list_SP->obj_id);
        fl_build_elem_S.fb_format = fl_widget_desc_SP->fb_format;
        fl_pix_format = hmi_gfx_mgr02_imxrt_lcdif_get_layer_pix_format((UINT8)fl_build_elem_S.fb_format);  //test

        if (GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id)) 
        {
        #if GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS > 0
            if (fl_obj_id < (UINT32)GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS)
            {
                if (fl_widget_desc_SP->clip_mode == GFX_MGR02_WP_CLIP_NONE) 
                {
                    GFX_MGR02_WIDGET_DYN_PROPERTY const *fl_wdgt_anim_prop_SP =	&l_layer_anim_data_SP->widget_prop[fl_obj_id];
                    fl_build_elem_S.area.x = fl_wdgt_anim_prop_SP->coord.x;
                    fl_build_elem_S.area.y = fl_wdgt_anim_prop_SP->coord.y;
                    fl_clear_buffer = TRUE;
                    fl_clear_color = fl_widget_desc_SP->bg_fill_color;
                    p_win_data_SP->win_colour = fl_wdgt_anim_prop_SP->fg_color;
                }
                else 
                {
                    fl_build_elem_S.area.x = lc_widget_anim_property_S[fl_obj_id].coord.x;
                    fl_build_elem_S.area.y = lc_widget_anim_property_S[fl_obj_id].coord.y;
                    p_win_data_SP->win_colour =	lc_widget_anim_property_S[fl_obj_id].fg_color;
                }
            }
        #endif
        } 
        else 
        {
        #if GFX_MGR02_NUM_SWDG_INSTANCES > 0
            if (fl_obj_id < (UINT32)GFX_MGR02_NUM_SWDG_INSTANCES)
            {
                fl_build_elem_S.area.x = lc_swdg_const_property_S[fl_obj_id].coord.x;
                fl_build_elem_S.area.y = lc_swdg_const_property_S[fl_obj_id].coord.y;
                p_win_data_SP->win_colour = lc_swdg_const_property_S[fl_obj_id].fg_color;
            }
        #endif
        }
        
        if (fl_image_desc_SP != GFX_MGR02_NULL_PTR)
        {
        #if defined(GFX_MGR02_CLIPPED_WIDGETS)
            fl_elem_clip_S.sx = (SINT16) p_win_data_SP->win_prop.topLeftX;
            fl_elem_clip_S.sy = (SINT16) p_win_data_SP->win_prop.topLeftY;
            fl_elem_clip_S.ex = (SINT16) fl_build_elem_S.area.width;
            fl_elem_clip_S.ey = (SINT16) fl_build_elem_S.area.height;
            fl_elem_clip_S.ex += fl_elem_clip_S.sx;
            fl_elem_clip_S.ey += fl_elem_clip_S.sy;
            if (hmi_gfx_mgr02_context_validate_clip(&p_win_data_SP->clip,&fl_elem_clip_S) == FALSE) 
            {
                fl_start_offset = (p_win_data_SP->clip.sx - (SINT32) p_win_data_SP->win_prop.topLeftX);
                if ((fl_start_offset >= 0)&& (fl_start_offset < (SINT32) fl_image_desc_SP->width))
                {
                    fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
                    fl_buff_offset = ((fl_bpp * (UINT32) fl_start_offset) >> 3U);
                    fl_start_offset = (p_win_data_SP->clip.sy - (SINT32) p_win_data_SP->win_prop.topLeftY);
                    if ((fl_start_offset >= 0)&& (fl_start_offset < (SINT32) fl_image_desc_SP->height))
                    {
                        fl_buff_offset += ((UINT32) fl_start_offset	* ((fl_bpp * (UINT32)fl_image_desc_SP->width) >> 3U));
                        p_win_data_SP->win_prop.topLeftX =	(UINT32) p_win_data_SP->clip.sx;
                        p_win_data_SP->win_prop.topLeftY =	(UINT32) p_win_data_SP->clip.sy;
                        p_win_data_SP->win_prop.width = (UINT32) p_win_data_SP->clip.ex;
                        p_win_data_SP->win_prop.width -= (UINT32) p_win_data_SP->clip.sx;
                        p_win_data_SP->win_prop.height = (UINT32) p_win_data_SP->clip.ey;
                        p_win_data_SP->win_prop.height -= (UINT32) p_win_data_SP->clip.sy;
                    }
                }
            }
        #endif
            
        #if GFX_MGR02_NUM_OF_CLUTS > 0
            if(fl_image_desc_SP->clut < (UINT16)GFX_MGR02_NUM_OF_CLUTS)
            {
                GFX_MGR02_CLUT_DATA const * fl_elem_clut_SP = &lc_gfx_mgr02_clut_array[fl_image_desc_SP->clut];
                void * fl_clut_p =(void *) fl_elem_clut_SP->CLUT;
                (void)LCDIFV2_SetLut(DEMO_LCDIF, (UINT8)p_layer_index, (uint32_t *)fl_clut_p, fl_elem_clut_SP->CLUTsize, TRUE);
            }
        #endif
            
            if ((fl_widget_desc_SP->rr_engine == GFX_MGR02_RT_DEFAULT) || (fl_widget_desc_SP->rr_engine == GFX_MGR02_RT_VGLITE))
            {
                /*
                ** no need to build again if the content is active / nothing changed
                */
                fl_element_change_status =	hmi_gfx_mgr02_layout_is_element_childrens_changed(p_elem_list_SP, TRUE);
                if ((fl_element_change_status != FALSE)	|| (p_win_data_SP->win_sts == GFX_MGR02_IMXRT_WIN_DIRTY)) 
                {
                    UINT32 fl_updated;
                    fl_build_elem_S.client_id = (UINT32) fl_widget_desc_SP->client_id;
                    #if defined(GFX_MGR02_MEM_MGMT_STATIC_ALLOCATION)    
                    fl_build_elem_S.fb_group_id   = fl_widget_desc_SP->fb_group_id;
                    #endif
                    #if defined(GFX_MGR02_VGLITE)
                    if (fl_widget_desc_SP->rr_engine == GFX_MGR02_RT_VGLITE)
                    {
                        fl_build_elem_S.fb_target = GFX_MGR02_TARGET_VGLITE;
                    }
                    else
                    #endif    
                    {
                        fl_build_elem_S.fb_target = GFX_MGR02_TARGET_IMXRT_PXP;
                    }
                    fl_build_elem_S.clr_buffer = fl_clear_buffer;
                    fl_build_elem_S.clr_color = fl_clear_color;
                    fl_build_elem_S.render_buffer = NULL;
                    /* dirty area check true for mask widget and normal widget */
                    fl_build_elem_S.dirty_area = TRUE;
                    fl_updated = hmi_gfx_mgr02_generic_build_dcu_gen_widget(&fl_build_elem_S, p_elem_list_SP);
                    if ((fl_updated != FALSE)|| (p_win_data_SP->render_buffer != fl_build_elem_S.render_buffer)) 
                    {
                        lcdifv2_buffer_config_t fbConfig;
                    #if defined(GFX_MGR02_CLIPPED_WIDGETS)
                        if ((p_win_data_SP->win_prop.width != fl_build_elem_S.area.width)
                                || (p_win_data_SP->win_prop.height != fl_build_elem_S.area.height)) 
                        {
                            fl_buff_offset += (UINT32) fl_build_elem_S.render_buffer;
                            fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
                            fbConfig.pixelFormat = fl_pix_format;
                            fbConfig.strideBytes = ((UINT16)(p_win_data_SP->win_prop.width * fl_bpp)) >> 3U;
                            LCDIFV2_SetLayerBufferConfig(DEMO_LCDIF, (UINT8)p_layer_index,&fbConfig);
                            hmi_gfx_mgr02_set_blendmode(p_win_data_SP, p_layer_index,fl_pix_format);
                            LCDIFV2_SetLayerSize(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->win_prop.width, (UINT16)p_win_data_SP->win_prop.height);
                            LCDIFV2_SetLayerOffset(DEMO_LCDIF, (UINT8)p_layer_index,  (UINT16)p_win_data_SP->posx, (UINT16)p_win_data_SP->posy);
                            hmi_gfx_mgr02_imxrt_lcdif_render_window(p_layer_index,(void *)fl_buff_offset);
                        }
                        else
                    #endif
                        {
                            fl_pix_format = hmi_gfx_mgr02_imxrt_lcdif_get_layer_pix_format((UINT8)fl_build_elem_S.fb_format);  //test
                            fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
                            fbConfig.pixelFormat = fl_pix_format;
                            fbConfig.strideBytes = ((UINT16)(p_win_data_SP->win_prop.width * fl_bpp)) >> 3U;
                            LCDIFV2_SetLayerBufferConfig(DEMO_LCDIF, (UINT8)p_layer_index,&fbConfig);
                            hmi_gfx_mgr02_set_blendmode(p_win_data_SP, p_layer_index,fl_pix_format);
                            LCDIFV2_SetLayerSize(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->win_prop.width, (UINT16)p_win_data_SP->win_prop.height);
                            LCDIFV2_SetLayerOffset(DEMO_LCDIF, (UINT8)p_layer_index,  (UINT16)p_win_data_SP->posx, (UINT16)p_win_data_SP->posy);
                            hmi_gfx_mgr02_imxrt_lcdif_render_window(p_layer_index,fl_build_elem_S.render_buffer);
                        }
                        p_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_UPDATED;
                        p_win_data_SP->win = 1;
                    }
                    else 
                    {
                        GFX_MGR02_UNUSED_VAR(fl_pix_format);
                    }
                } 
                else if ((UINT8) hmi_gfx_mgr02_layout_is_element_changed((UINT32) p_elem_list_SP->base_id,p_elem_list_SP->obj_id) != FALSE) 
                {
                
                    lcdifv2_buffer_config_t fbConfig;
                #if defined(GFX_MGR02_CLIPPED_WIDGETS)
                    if ((p_win_data_SP->win_prop.width != fl_build_elem_S.area.width)
                        || (p_win_data_SP->win_prop.height != fl_build_elem_S.area.height)) 
                    {
                        fl_buff_offset += (UINT32) p_win_data_SP->render_buffer;
                        fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
                        fbConfig.pixelFormat = fl_pix_format;
                        fbConfig.strideBytes = ((UINT16)(p_win_data_SP->win_prop.width * fl_bpp)) >> 3U;
                        LCDIFV2_SetLayerBufferConfig(DEMO_LCDIF, (UINT8)p_layer_index,&fbConfig);
                        hmi_gfx_mgr02_set_blendmode(p_win_data_SP, p_layer_index,fl_pix_format);
                        LCDIFV2_SetLayerSize(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->win_prop.width, (UINT16)p_win_data_SP->win_prop.height);
                        LCDIFV2_SetLayerOffset(DEMO_LCDIF, (UINT8)p_layer_index,  (UINT16)p_win_data_SP->posx, (UINT16)p_win_data_SP->posy);
                        hmi_gfx_mgr02_imxrt_lcdif_render_window(p_layer_index,(void *)fl_buff_offset);
                    } 
                    else
                #endif
                    {
                        fl_pix_format = hmi_gfx_mgr02_imxrt_lcdif_get_layer_pix_format((UINT8)fl_build_elem_S.fb_format);
                        fl_bpp = hmi_gfx_mgr02_imxrt_lcdif_get_bpp(fl_pix_format);
                        fbConfig.pixelFormat = fl_pix_format;
                        fbConfig.strideBytes = ((UINT16)(p_win_data_SP->win_prop.width * fl_bpp)) >> 3U;
                        LCDIFV2_SetLayerBufferConfig(DEMO_LCDIF, (UINT8)p_layer_index,&fbConfig);
                        hmi_gfx_mgr02_set_blendmode(p_win_data_SP, p_layer_index,fl_pix_format);
                        LCDIFV2_SetLayerSize(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->win_prop.width, (UINT16)p_win_data_SP->win_prop.height);
                        LCDIFV2_SetLayerOffset(DEMO_LCDIF, (UINT8)p_layer_index, (UINT16)p_win_data_SP->posx, (UINT16)p_win_data_SP->posy);
                        hmi_gfx_mgr02_imxrt_lcdif_render_window(p_layer_index,fl_build_elem_S.render_buffer);
                    }
                    p_win_data_SP->win_sts = GFX_MGR02_IMXRT_WIN_UPDATED;
                    p_win_data_SP->win = 1;
                } 
                else 
                {
                    /* Adding comment to fix MISRA c-2012 Rule 15.7 */
                }
            }
        }
    }
}
#endif /* GFX_MGR02_NUM_OF_SWDGS > 0 */

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_imxrt_get_disp_content_status
 ** Visibility:       Global
 ** Description:      Interface to get display content status .
 **
 ** Invocation:       By hmi_gfx_mgr02_layout.c
 ** Inputs/Outputs:   l_content_ready_ondisplay
 **                   0 -> default.
 **                   1 -> Display active with background colour set.
 **                   2 -> Display active with active layer alongwith
 **                        background colour set.
 ** Critical Section: None.
 **==========================================================================*/

UINT32 hmi_gfx_mgr02_imxrt_get_disp_content_status(void) {
    return (l_content_ready_ondisplay);
}

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_amber_set_disp_bgcolor
 ** Visibility:       Global
 ** Description:      This function is used to set the BG colour of the Display.
 **
 ** Invocation:       By Application
 ** Inputs/Outputs:   Tndex of the Display , BG colour
 ** Critical Section: None.
 ** Created:          08-Dec-2015 by SSIGAMAN
 ** Updated:          08-Dec-2015 by SSIGAMAN
 **==========================================================================*/

