RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
void hmi_gfx_mgr02_amber_set_disp_bgcolor(UINT8 p_disp_index_u8,UINT32 p_bg_color_u32) 
{
    if (p_disp_index_u8 < (UINT8) GFX_MGR02_NUM_LAYERS)
    {
        l_disp_comp[p_disp_index_u8].bg_colour = p_bg_color_u32;
    }
}

#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_is_image_transparent
 ** Visibility:       static
 ** Description:
 ** Invocation:
 ** Inputs/Outputs:
 ** Critical Section: None.
 ** Created:          06-Oct-2014 by SSIGAMAN.
 **==========================================================================*/
static UINT8 hmi_gfx_mgr02_is_image_transparent(UINT8 fl_format_U8) 
{
    UINT8 fl_image_transparent_U8;

    switch (fl_format_U8) 
    {
        case kPXP_AsPixelFormatARGB8888:
        case kPXP_AsPixelFormatARGB1555:
        case kPXP_AsPixelFormatARGB4444: 
        {
            fl_image_transparent_U8 = (UINT8)TRUE;
        }
            break;
        default: 
        {
            fl_image_transparent_U8 = (UINT8)FALSE;
        }
            break;
    }
    return fl_image_transparent_U8;
}
#endif

#if (GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0) || (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_is_widget_transparent
 ** Visibility:       static
 ** Description:
 ** Invocation:
 ** Inputs/Outputs:
 ** Critical Section: None.
 ** Created:          06-Oct-2014 by SSIGAMAN.
 **==========================================================================*/
static UINT8 hmi_gfx_mgr02_is_widget_transparent(UINT8 fl_format_U8) 
{
    UINT8 fl_image_transparent_U8;
    switch (fl_format_U8) 
    {
    
        case GFX_MGR02_PIX_FORMAT_ARGB8888:
        case GFX_MGR02_PIX_FORMAT_ARGB1555:
        case GFX_MGR02_PIX_FORMAT_ARGB4444:
        case GFX_MGR02_PIX_FORMAT_8BPP:
        case GFX_MGR02_PIX_FORMAT_4BPP:
        case GFX_MGR02_PIX_FORMAT_2BPP:
        {
            fl_image_transparent_U8 = (UINT8)TRUE;
        }
            break;
        default: 
        {
            fl_image_transparent_U8 = (UINT8)FALSE;
        }
            break;
    }
    return fl_image_transparent_U8;
}
#endif

/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_manage_layers_is_child_visible
 ** Visibility:       static
 ** Description:      Determines whether a passed layer is visible or not.
 **                   A passed area is checked against each element above it to
 **                   determine if it is hidden or not. Incase the passed area
 **                   is partially hidden, the exposed area will be again examined
 **                   recursively to see the overall hidden or visible status.
 **                   For example for a reactangle area X, and if there are 5 elements
 **                   above it (elem 1 to 5). Now if elem 1 covers only a small area c
 **                   as shown below
 **                   -----------------
 **                   +               +
 **                   + a             +
 **                   +-------+++++++++
 **                   +\\\c\\\+   b   +
 **                   -----------------
 **                   this function will recursively check for the exposed sub area
 **                   'a' (Visible top portion) and 'b' (Visible Right portion) seperately
 **                   against elem 2 to 5 to see if they are getting
 **                   hidden or not.  So after the recursive loop finally determines that
 **                   a passed area is fully hidden it returns FALSE else it returns TRUE.
 **                   02_design\hmi_gfx_mgr02_design.xls implements a xls macro to proveout
 **                   this logic.
 ** Invocation:       By hmi_gfx_mgr02_manage_layers().
 ** Inputs/Outputs:   p_area          - Pointer to area of the element
 **                   p_elem_list_SAP - Pointer to the element list above.
 **                   p_num_elements  - number of elements in p_elem_list_SAP.
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
/* Deviation - MISRA C-2012 Rule 17.2 - Recursive function call cannot be avoided */
static UINT32 hmi_gfx_mgr02_manage_layers_is_child_visible(	GFX_MGR02_ELEMENT_AREA const *p_area,
                                                            UINT32 p_num_elements,
                                                            GFX_MGR02_WINDOW_DATA_T *p_window_SP) 
{
    UINT32 fl_layer_visible = GFX_MGR02_ELEMENT_INVALID;
    GFX_MGR02_ELEMENT_AREA fl_area = { 0, 0, 0, 0, GFX_MGR02_OPEQUE, 255 };
    GFX_MGR02_ELEMENT_AREA fl_area2 = { 0, 0, 0, 0, GFX_MGR02_OPEQUE, 255 };
    SINT16 fl_temp;
    UINT32 fl_num_elements = p_num_elements;
    GFX_MGR02_WINDOW_DATA_T *fl_window_SP = p_window_SP;
    while ((fl_layer_visible == GFX_MGR02_ELEMENT_INVALID)&& (fl_num_elements > (UINT32) 0))
    {
        fl_area.sx = (SINT16) fl_window_SP->win_prop.topLeftX;
        fl_area.sy = (SINT16) fl_window_SP->win_prop.topLeftY;
        fl_area.ex = (SINT16) fl_window_SP->win_prop.width;
        fl_area.ey = (SINT16) fl_window_SP->win_prop.height;
        fl_area.alpha = (UINT8) fl_window_SP->alpha;

        if (fl_area.alpha == (UINT8) 0)
        {
            /*
             ** The alpha will never be a value of zero. i.e. if zero then this
             ** element will never add to the windows itself. It is only for safety
             ** purpose
             ** nkrishn9 confirm the statement from emanoj
             */
            fl_area.is_transparent = (UINT8) GFX_MGR02_TRANSPARENT;
        } 
        else if ((fl_window_SP->see_through != (UINT8) 0)|| (fl_area.alpha < (UINT8) 255)) 
        {
            fl_area.is_transparent = (UINT8) GFX_MGR02_SEETHROUGH;
        }
        else 
        {
            fl_area.is_transparent = (UINT8) GFX_MGR02_OPEQUE;
        }

        fl_num_elements--;
        fl_window_SP++;
        while (fl_num_elements > (UINT32) 0)
            {
            fl_num_elements--;
            fl_window_SP++;
            if (fl_area.is_transparent == (UINT8) GFX_MGR02_OPEQUE) {
                if ((fl_area.sx <= p_area->sx) && (fl_area.sy <= p_area->sy)
                        && (fl_area.ex >= p_area->ex)
                        && (fl_area.ey >= p_area->ey)) {
                    /*
                     ** p_area is completely hidden in fl_area
                     */
                    fl_layer_visible = GFX_MGR02_ELEMENT_INVISIBLE;
                } else if (((fl_area.sx >= p_area->sx)
                        && (fl_area.sx <= p_area->ex))
                        || ((fl_area.ex >= p_area->sx)
                                && (fl_area.ex <= p_area->ex))
                        || ((fl_area.sx < p_area->sx)
                                && (fl_area.ex > p_area->ex))) {
                    if (((fl_area.sy >= p_area->sy)
                            && (fl_area.sy <= p_area->ey))
                            || ((fl_area.ey >= p_area->sy)
                                    && (fl_area.ey <= p_area->ey))
                            || ((fl_area.sy < p_area->sy)
                                    && (fl_area.ey > p_area->ey))) {
                        /*
                         ** Layer is overlapping.
                         */
                        fl_area2.sx = p_area->sx;
                        fl_area2.sy = p_area->sy;
                        fl_area2.ex = p_area->ex;
                        fl_area2.ey = p_area->ey;
                        fl_area2.is_transparent = p_area->is_transparent;

                        if (fl_area.sy > p_area->sy) {
                            /*
                             ** Visible top portion of the p_area rectangle
                             */
                            fl_area2.ey = (fl_area.sy - (SINT16) 1);
                            fl_layer_visible =
                                    hmi_gfx_mgr02_manage_layers_is_child_visible(
                                            (GFX_MGR02_ELEMENT_AREA const*) &fl_area2,
                                            fl_num_elements, fl_window_SP);
                            fl_area2.sy = fl_area.sy;
                            fl_area2.ey = p_area->ey;
                        }
                        if ((fl_area.ey < p_area->ey)
                                && (fl_layer_visible
                                        != GFX_MGR02_ELEMENT_VISIBLE)) {
                            /*
                             ** Visible bottom portion of the p_area rectangle
                             */
                            fl_temp = fl_area2.sy;
                            fl_area2.sy = (fl_area.ey + (SINT16) 1);
                            fl_layer_visible =
                                    hmi_gfx_mgr02_manage_layers_is_child_visible(
                                            (GFX_MGR02_ELEMENT_AREA const*) &fl_area2,
                                            fl_num_elements, fl_window_SP);
                            fl_area2.sy = fl_temp;
                            fl_area2.ey = fl_area.ey;
                        }
                        if ((fl_area.sx > p_area->sx)
                                && (fl_layer_visible
                                        != GFX_MGR02_ELEMENT_VISIBLE)) {
                            /*
                             ** Visible Left portion of the p_area rectangle
                             */
                            fl_area2.ex = (fl_area.sx - (SINT16) 1);
                            fl_layer_visible =
                                    hmi_gfx_mgr02_manage_layers_is_child_visible(
                                            (GFX_MGR02_ELEMENT_AREA const*) &fl_area2,
                                            fl_num_elements, fl_window_SP);
                            fl_area2.ex = p_area->ex;

