RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
                        }
                        if ((fl_area.ex < p_area->ex)
                                && (fl_layer_visible
                                        != GFX_MGR02_ELEMENT_VISIBLE)) {
                            /*
                             ** Visible Right portion of the p_area rectangle
                             */
                            fl_area2.sx = (fl_area.ex + (SINT16) 1);
                            fl_layer_visible =
                                    hmi_gfx_mgr02_manage_layers_is_child_visible(
                                            (GFX_MGR02_ELEMENT_AREA const*) &fl_area2,
                                            fl_num_elements, fl_window_SP);
                        }
                    }
                    /*
                     ** ELSE - Layer is not overlapping with fl_area so need to proceed to
                     **        next element in p_elem_list_SAP to see if that is overlapping.
                     */
                } else {
                    /* QAC fix... */
                }
                /*
                 ** ELSE - Layer is not overlapping with fl_area so need to proceed to
                 **        next element in p_elem_list_SAP to see if that is overlapping.
                 */

            }
        }
    }
    if (fl_layer_visible == GFX_MGR02_ELEMENT_INVALID) {
        fl_layer_visible = GFX_MGR02_ELEMENT_VISIBLE;
    }
    return (fl_layer_visible);
}

#if (GFX_MGR02_NUM_OF_FILLS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_get_tile_fill_layer_area
 ** Visibility:       static
 ** Description:      fetches the Tile, Fill elments area.
 ** Invocation:
 ** Inputs/Outputs:  GFX_MGR02_ELEMENT_AREA, GFX_MGR02_ELEM_LIST_T
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static void hmi_gfx_mgr02_get_tile_fill_layer_area(	GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area)
{
    UINT32 fl_obj_type = GFX_MGR02_GET_OBJ_TYPE(p_elem_list_SP->obj_id);
    UINT32 fl_obj_id = GFX_MGR02_GET_OBJ_ID(p_elem_list_SP->obj_id);

    if (GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id))
    {
        if (fl_obj_type == GFX_MGR02_TYPE_FILL) 
        {
#if GFX_MGR02_NUM_FILL_ANIM_ELEMENTS > 0
            if(fl_obj_id < (UINT32)GFX_MGR02_NUM_FILL_ANIM_ELEMENTS)
            {
                hmi_gfx_mgr02_context_set_loc((GFX_MGR02_ILOC_DATA const*) &l_layer_anim_data_SP->fill_prop[fl_obj_id].coord);
                hmi_gfx_mgr02_context_set_alpha((u_gx_flocal)l_layer_anim_data_SP->fill_prop[fl_obj_id].alpha);
                p_elem_area->ex = (SINT16) l_layer_anim_data_SP->fill_prop[fl_obj_id].dim.width;
                p_elem_area->ey = (SINT16) l_layer_anim_data_SP->fill_prop[fl_obj_id].dim.height;
            p_elem_area->is_transparent = (UINT8) GFX_MGR02_OPEQUE;
            }
#endif
        }
    }
    else 
    {
        if (fl_obj_type == GFX_MGR02_TYPE_FILL) 
        {
#if GFX_MGR02_NUM_FILL_INSTANCES > 0
            if((fl_obj_id < (UINT32)GFX_MGR02_NUM_FILL_INSTANCES) && (p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_OF_FILLS))
            {
            hmi_gfx_mgr02_context_set_loc(&lc_fill_const_property_S[fl_obj_id].coord);
            hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) lc_fill_const_property_S[fl_obj_id].alpha);
            p_elem_area->ex = (SINT16) lc_fill_layer_def_S[p_elem_list_SP->base_id].dim.width;
            p_elem_area->ey = (SINT16) lc_fill_layer_def_S[p_elem_list_SP->base_id].dim.height;
            p_elem_area->is_transparent = (UINT8) GFX_MGR02_OPEQUE;
            }
#endif
        }
    }
}
#endif

#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_get_image_layer_area
 ** Visibility:       static
 ** Description:      fetches the Image elments area.
 ** Invocation:
 ** Inputs/Outputs:  GFX_MGR02_ELEMENT_AREA, GFX_MGR02_ELEM_LIST_T
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static UINT32 hmi_gfx_mgr02_get_image_layer_area(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area) 
{
    UINT32 fl_vaof_index = GFX_MGR02_INVALID_ID;
#if((GFX_MGR02_NUM_USER_LAYERS > 0 )|| (GFX_MGR02_NUM_3D_MDL_LAYERS > 0))
    UINT32 fl_obj_type = GFX_MGR02_GET_OBJ_TYPE(p_elem_list_SP->obj_id);
#endif
    UINT32 fl_obj_id = GFX_MGR02_GET_OBJ_ID(p_elem_list_SP->obj_id);
    GFX_MGR02_IMAGE_DEF_T const *fl_image_layer_def_SP;

#if GFX_MGR02_NUM_USER_LAYERS > 0
    if (fl_obj_type == GFX_MGR02_TYPE_USER_LAYER) 
    {
        if(p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_USER_LAYERS)
        {
            fl_image_layer_def_SP =	&l_layer_anim_data_SP->user_image_layer[p_elem_list_SP->base_id];
            if (GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id)) 
            {
#if GFX_MGR02_NUM_USER_ANIM_ELEMENTS > 0
                if(fl_obj_id < (UINT32)GFX_MGR02_NUM_USER_ANIM_ELEMENTS)
                {
                    GFX_MGR02_IMAGE_DYN_PROPERTY * fl_img_dyn_prop_SP = &l_layer_anim_data_SP->user_prop[fl_obj_id];
                    hmi_gfx_mgr02_context_set_loc((GFX_MGR02_ILOC_DATA const *)&fl_img_dyn_prop_SP->coord);
                    hmi_gfx_mgr02_context_set_alpha((u_gx_flocal)fl_img_dyn_prop_SP->alpha);
                }
       #endif
            } 
            else 
            {
#if GFX_MGR02_NUM_SIMAGE_INSTANCES > 0
                if(fl_obj_id < (UINT32)GFX_MGR02_NUM_SIMAGE_INSTANCES)
                {
                    GFX_MGR02_IMAGE_PROPERTY const *fl_img_prop_SP = &lc_img_const_property_S[fl_obj_id];
                    hmi_gfx_mgr02_context_set_loc(&fl_img_prop_SP->coord);
                    hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_img_prop_SP->alpha);
                }
#endif
            }
            p_elem_area->ey = (SINT16) fl_image_layer_def_SP->height;
            p_elem_area->ex = (SINT16) fl_image_layer_def_SP->width;
        }
    }
    else
#endif
    {
#if GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
        if(p_elem_list_SP->base_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
        {
            fl_image_layer_def_SP = &lc_image_layer_def_S[p_elem_list_SP->base_id];
            if (GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id))
            {
#if GFX_MGR02_NUM_IMAGE_ANIM_ELEMENTS > 0
                if(fl_obj_id < (UINT32)GFX_MGR02_NUM_IMAGE_ANIM_ELEMENTS)
                {
                    GFX_MGR02_IMAGE_DYN_PROPERTY const *fl_img_dyn_prop_SP = &l_layer_anim_data_SP->image_prop[fl_obj_id];
                    hmi_gfx_mgr02_context_set_loc(&fl_img_dyn_prop_SP->coord);
                    hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_img_dyn_prop_SP->alpha);
                }
#endif
            } 
            else
            {
#if GFX_MGR02_NUM_SIMAGE_INSTANCES > 0
                if(fl_obj_id < (UINT32)GFX_MGR02_NUM_SIMAGE_INSTANCES)
                {
                    GFX_MGR02_IMAGE_PROPERTY const *fl_img_prop_SP = &lc_img_const_property_S[fl_obj_id];
                    hmi_gfx_mgr02_context_set_loc(&fl_img_prop_SP->coord);
                    hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_img_prop_SP->alpha);
                }        
#endif
            }
            if (fl_image_layer_def_SP->vaoa_index != (UINT8) 0) 
            {
                fl_vaof_index = (UINT8) fl_image_layer_def_SP->vaoa_index;
            }
            p_elem_area->ey = (SINT16) fl_image_layer_def_SP->height;
            p_elem_area->ex = (SINT16) fl_image_layer_def_SP->width;
        }
#endif
    }
    p_elem_area->is_transparent = (UINT8) GFX_MGR02_OPEQUE;
    return (fl_vaof_index);
}
#endif /* (GFX_MGR02_NUM_SIMAGE_INSTANCES > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0) */

#if GFX_MGR02_NUM_OF_SWDGS > 0
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_get_widget_layer_area
 ** Visibility:       static
 ** Description:      fetches the Widget elments area.
 ** Invocation:
 ** Inputs/Outputs:  GFX_MGR02_ELEMENT_AREA, GFX_MGR02_ELEM_LIST_T, Visible Area Offset
 ** Critical Section: None.
 ** Created:          21-Aug-2014 by NKRISHN9
 ** Updated:          21-Aug-2014 by NKRISHN9
 **==========================================================================*/
static UINT32 hmi_gfx_mgr02_get_widget_layer_area(GFX_MGR02_ELEM_LIST_T const *p_elem_list_SP,GFX_MGR02_ELEMENT_AREA *p_elem_area)
{
    UINT32 fl_vaof_index = GFX_MGR02_INVALID_ID;
    UINT32 fl_obj_id = GFX_MGR02_GET_OBJ_ID(p_elem_list_SP->obj_id);
    UINT16 fl_base_id = p_elem_list_SP->base_id;

