RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/gdt/ui_core_gdt/ui.core.gdt/hmi.gfx.manager.02/src/hmi_gfx_mgr02_imxrt.c
    if (fl_base_id < (UINT16)GFX_MGR02_NUM_OF_SWDGS)
    {
        GFX_MGR02_WIDGET_DEF_T const *fl_widget_layer_def_SP =	&lc_swidget_layer_def_S[fl_base_id];

        if(((fl_widget_layer_def_SP->rr_engine == GFX_MGR02_RT_DEFAULT) || (fl_widget_layer_def_SP->rr_engine == GFX_MGR02_RT_VGLITE)) &&
           (fl_widget_layer_def_SP->clip_mode == GFX_MGR02_WP_CLIP_NONE) &&(fl_widget_layer_def_SP->merge!=(UINT8)0))
        {
        #if (GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0)
            GFX_FLOAT  fl_bound[4];
            /*
            ** if clip not set, then the
            ** widget area needs to be calculated dynamically based on 
            ** current transformed bounds of the widget layer
            ** For this to work the element has to be animation enabled, so that
            ** its XY location can be modified.
            ** After the bound is calculated, it needs to be loaded to l_runtime_wdg_image_layer_def_S
            ** which is placed in RAM.
            */
            if (fl_widget_layer_def_SP->image_id < (UINT16)GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS)
            {
                GFX_MGR02_IMAGE_DEF_T   *fl_image_layer_def_SP = &l_runtime_wdg_image_layer_def_S[fl_widget_layer_def_SP->image_id];
                if(GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id))
                {
                #if GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS > 0
                    UINT32 fl_aligned_width;
                    UINT32 fl_aligned_height;
                    if (fl_obj_id < (UINT32)GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS)
                    {
                        GFX_MGR02_WIDGET_DYN_PROPERTY * fl_widg_dyn_prop_SP = &l_layer_anim_data_SP->widget_prop[fl_obj_id];
                        
                        if (fl_widget_layer_def_SP->rr_engine == GFX_MGR02_RT_VGLITE)
                        {
                            (void)hmi_gfx_mgr02_generic_get_element_bound(p_elem_list_SP, (u_gx_flocal)GFX_MGR02_TARGET_VGLITE, fl_bound);
                        }
                        else
                        {
                            (void)hmi_gfx_mgr02_generic_get_element_bound(p_elem_list_SP, (u_gx_flocal)GFX_MGR02_TARGET_IMXRT_PXP, fl_bound);
                        }

                        fl_widg_dyn_prop_SP->coord.x    = (SINT16)fl_bound[0];
                        fl_widg_dyn_prop_SP->coord.y    = (SINT16)fl_bound[1];
                        fl_bound[0] -= (GFX_FLOAT)fl_widg_dyn_prop_SP->coord.x; /* get any remaining fractional part */
                        fl_bound[1] -= (GFX_FLOAT)fl_widg_dyn_prop_SP->coord.y;

                        fl_aligned_width  = (UINT32)(fl_bound[2] + fl_bound[0] + 0.5f);
                        fl_aligned_height = (UINT32)(fl_bound[3] + fl_bound[1] + 0.5f);

                        fl_image_layer_def_SP->width  = (GFX_MGR02_ISIZE_W_T)(fl_aligned_width);
                        fl_image_layer_def_SP->height = (GFX_MGR02_ISIZE_H_T)(fl_aligned_height);
                    }
                #endif
                }
                else
                {
                    fl_image_layer_def_SP->width  = (UINT16)0;
                    fl_image_layer_def_SP->height = (UINT16)0;
                }
                p_elem_area->ey = (SINT16)fl_image_layer_def_SP->height;
                p_elem_area->ex = (SINT16)fl_image_layer_def_SP->width;
                if(fl_image_layer_def_SP->vaoa_index != (UINT8)0)
                {
                    fl_vaof_index = (UINT8)fl_image_layer_def_SP->vaoa_index;
                }
            }
        #else
            /*
            ** Not a valid configuration & never expected to run.
            ** Make the layer invisible
            */
            p_elem_area->ey  = -1;
            p_elem_area->ex  = -1;
        #endif
        }
        else
        {
    #if  GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0
               if( fl_widget_layer_def_SP->image_id < (UINT16)GFX_MGR02_NUM_OF_IMAGE_LAYERS)
               {
                   GFX_MGR02_IMAGE_DEF_T const *fl_image_layer_def_SP = &lc_image_layer_def_S[fl_widget_layer_def_SP->image_id];
                   p_elem_area->ey = (SINT16) fl_image_layer_def_SP->height;
                   p_elem_area->ex = (SINT16) fl_image_layer_def_SP->width;
                   if (fl_image_layer_def_SP->vaoa_index != (UINT8) 0)
                   {
                       fl_vaof_index = (UINT8) fl_image_layer_def_SP->vaoa_index;
                   }
               }
    #endif
        }

        if (fl_widget_layer_def_SP->merge != (UINT8) 0) 
        {
            p_elem_area->is_transparent = (UINT8) GFX_MGR02_OPEQUE;
        }

        if (GFX_MGR02_IS_DYNAMIC_PROP(p_elem_list_SP->obj_id))
        {
        #if GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS > 0
            if(fl_obj_id < (UINT32)GFX_MGR02_NUM_WIDGET_ANIM_ELEMENTS)
            {
                GFX_MGR02_WIDGET_DYN_PROPERTY const *fl_widg_dyn_prop_SP =	&l_layer_anim_data_SP->widget_prop[fl_obj_id];
                
                hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) fl_widg_dyn_prop_SP->alpha);
            #if defined(GFX_MGR02_CLIPPED_WIDGETS)
                if (fl_widget_layer_def_SP->clip_mode != GFX_MGR02_WP_CLIP_NONE) 
                {
                    GFX_MGR02_WIDGET_PROPERTY const *fl_elem_prop_SP;
                    GFX_MGR02_ILOC_DATA fl_coord;
                    /*
                     ** When hmi_gfx_mgr02_context_set_clip is invoked, the clip
                     ** start X & Y is added with the current XY location in context
                     ** So we need to make sure we just have the offset of XY movement
                     ** alone in context prior to hmi_gfx_mgr02_context_set_clip call
                     ** After this call we can set the raw co-ordinate values
                     */
                    fl_elem_prop_SP = &lc_widget_anim_property_S[fl_obj_id];
                    fl_coord.x = (SINT16) (-fl_elem_prop_SP->coord.x);
                    fl_coord.y = (SINT16) (-fl_elem_prop_SP->coord.y);
                    hmi_gfx_mgr02_context_set_loc(&fl_coord);
                    hmi_gfx_mgr02_context_set_loc(&fl_widg_dyn_prop_SP->coord);
                    hmi_gfx_mgr02_context_set_clip(&fl_widg_dyn_prop_SP->clip);
                    if (fl_widget_layer_def_SP->merge != (UINT8) 0) 
                    {
                        fl_coord.x = -fl_coord.x;
                        fl_coord.y = -fl_coord.y;
                        hmi_gfx_mgr02_context_set_loc(&fl_coord);
                    }
                }
                else
            #endif
                {
                    hmi_gfx_mgr02_context_set_loc(&fl_widg_dyn_prop_SP->coord);
                }
            }
        #endif
        } 
        else 
        {
        #if GFX_MGR02_NUM_SWDG_INSTANCES > 0
            if (fl_obj_id < (UINT32)GFX_MGR02_NUM_SWDG_INSTANCES)
            {
                if (fl_widget_layer_def_SP->clip_mode != GFX_MGR02_WP_CLIP_NONE) 
                {
                    if(fl_widget_layer_def_SP->clip_index < GFX_MGR02_NUM_VISIBLE_AREA)
                    {                     
                      GFX_MGR02_IAREA_DATA fl_clip_area_SP;
                      fl_clip_area_SP.x =  lc_elem_area_offset_SA[fl_widget_layer_def_SP->clip_index].sx;
                      fl_clip_area_SP.y =  lc_elem_area_offset_SA[fl_widget_layer_def_SP->clip_index].sy;
                      fl_clip_area_SP.width  =  (UINT16) lc_elem_area_offset_SA[fl_widget_layer_def_SP->clip_index].ex;
                      fl_clip_area_SP.height =(UINT16) lc_elem_area_offset_SA[fl_widget_layer_def_SP->clip_index].ey;
                      hmi_gfx_mgr02_context_set_clip(&fl_clip_area_SP);
                    }
                }
            
                hmi_gfx_mgr02_context_set_loc(&lc_swdg_const_property_S[fl_obj_id].coord);
                hmi_gfx_mgr02_context_set_alpha((u_gx_flocal) lc_swdg_const_property_S[fl_obj_id].alpha);
            }
    #endif
        }
    }
    return (fl_vaof_index);
}
#endif  /* GFX_MGR02_NUM_OF_SWDGS */

#if (GFX_MGR02_NUM_OF_IMAGE_LAYERS > 0) || (GFX_MGR02_NUM_USER_LAYERS > 0)||(GFX_MGR02_NUM_AMBER_MERGE_WIDGETS>0)
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_set_blendmode
 ** Visibility:       static
 ** Description:
 ** Invocation:
 ** Inputs/Outputs:
 ** Critical Section: None.
 ** Created:          06-Oct-2014 by SSIGAMAN.
 **==========================================================================*/
static void hmi_gfx_mgr02_set_blendmode( GFX_MGR02_WINDOW_DATA_T const *p_wind,UINT32 p_layer_index, lcdifv2_pixel_format_t pix_format)
{
    lcdifv2_blend_config_t config = {0};
    config.globalAlpha =  p_wind->alpha;
    config.alphaMode = kLCDIFV2_AlphaEmbedded;

    LCDIFV2_SetLayerBlendConfig(DEMO_LCDIF, (UINT8)p_layer_index, &config);
    GFX_MGR02_UNUSED_VAR(pix_format);
}
#endif

/****************************************************************************
Function Name        : hmi_gfx_mgr02_imxrt_pxp_get_bound
Description          : Calculates the transformed bounds of an elements passed
boundary
Invocation           : 
Parameters           : Object, Context and boundary
Return Value         : Boundary
Critical Section     : None
External Interfaces  : None
******************************************************************************/
s_gx_flocal hmi_gfx_mgr02_imxrt_get_bound(GFX_MGR02_CONTEXT_T const * p_cntx_SP, GFX_FLOAT * p_bounds)
{
  p_bounds[0] = (GFX_FLOAT)p_cntx_SP->state.loc.x;
  p_bounds[1] = (GFX_FLOAT)p_cntx_SP->state.loc.y;
  /* return True by default since no error condition has been identified */
  return((s_gx_flocal)TRUE);
}

#if GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS > 0
/*============================================================================
 ** Function Name:    hmi_gfx_mgr02_imxrt_get_runtime_widget_ptr
 ** Visibility:       Global
 ** Description:      Interface to get pointer of l_runtime_wdg_image_layer_def_S .
 **
 ** Invocation:       By hmi_gfx_mgr02_context.c
 ** Inputs/Outputs:
 ** Critical Section: None.
 ** Created:          28-Jul-2017 by CSAKTHIV
 ** Updated:
 **==========================================================================*/

GFX_MGR02_IMAGE_DEF_T * hmi_gfx_mgr02_imxrt_get_runtime_widget_ptr(UINT16 p_img_id)
{
    GFX_MGR02_IMAGE_DEF_T *fl_image_def_SP = GFX_MGR02_NULL_PTR;
    if (p_img_id < (UINT16)GFX_MGR02_NUM_RUNTIME_WDG_IMG_LAYERS)
    {
        fl_image_def_SP = &l_runtime_wdg_image_layer_def_S[p_img_id];
}
    return fl_image_def_SP;
}
#endif

#ifdef  __cplusplus
}
#endif
#endif /* #if defined(GFX_MGR02_IMXRT) */
